Update documentation by using mermaid for UML and other views
